app/controllers/orders_controller.rb

SELECT "orders".* FROM "orders"
SELECT "products".* FROM "products" WHERE "products"."id" IN (1, 2)
---
  def index
    @orders = Order.includes(:product).all