app/controllers/products_controller.rb

SELECT "products".* FROM "products" WHERE (name LIKE '%funyuns%')
SELECT MAX("products"."updated_at") FROM "products"
---
  def index
    if params[:q]
      search_term = params[:q]
      @products = Product.search(search_term)

SELECT  "comments".* FROM "comments" WHERE "comments"."product_id" = ? ORDER BY created_at DESC LIMIT ? OFFSET ?  [["product_id", 1], ["LIMIT", 2], ["OFFSET", 0]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."product_id" = ?  [["product_id", 1]]
---
  def show
    @comments = @product.comments.order("created_at DESC").paginate(:page => params[:page], :per_page => 2)

INSERT INTO "products" ("name", "description", "image_url", "created_at", "updated_at", "colour", "price") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save

UPDATE "products" SET "colour" = ?, "price" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["colour", ""], ["price", 9999], ["updated_at", "2018-01-15 22:54:09.562200"], ["id", 3]]
---
  def update
    respond_to do |format|
      if @product.update(product_params)