app/controllers/simple_pages_controller.rb

  def index
  @products = Product.limit(3)
---
SELECT  "products".* FROM "products" LIMIT ?  [["LIMIT", 3]]

  def landing_page
    @products = Product.limit(3)
---
SELECT  "products".* FROM "products" LIMIT ?  [["LIMIT", 3]]