app/controllers/users_controller.rb

UPDATE "users" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["first_name", "Elijah "], ["last_name", "Laube"], ["updated_at", "2018-02-16 18:13:32.796958"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @user.update(user_params)