app/views/products/show.html.erb

SELECT  "comments".* FROM "comments" WHERE "comments"."product_id" = ? ORDER BY "comments"."rating" DESC LIMIT ?  [["product_id", 2], ["LIMIT", 1]]
SELECT AVG("comments"."rating") FROM "comments" WHERE "comments"."product_id" = ?  [["product_id", 1]]
---
<% if @product.comments.exists? %>
  <%= @product.comments.order(rating: :desc).first %>